{"title":"Regio-MPNN: Predicting Regioselectivity for General Metal-Catalyzed Cross-Coupling Reactions using Chemical Knowledge Informed Message Passing Neural Network","doi":"10.26434\/chemrxiv-2024-tddfc-v2","published_doi":"N.A.","published_url":"N.A.","authors":"Baochen Li; Yuru Liu; Haibin Sun; Rentao Zhang; Yongli Xie; Klement Foo; Frankie Mak; Ruimao Zhang; Tianshu Yu; Sen Lin; Peng Wang; Xiaoxue Wang","abstract":"As a fundamental problem in organic chemistry, synthesis planning aims at designing energy and cost-efficient reaction pathways for target compounds. In synthesis planning, it is crucial to understand regioselectivity, or the preference of a reaction over competing reaction sites. Precisely predicting regioselectivity enables early exclusion of unproductive reactions and paves the way to designing high-yielding synthetic routes with minimal separation and material costs. However, it is still at emerging state to combine chemical knowledge and data-driven methods to make practical predictions for regioselectivity. At the same time, metal-catalyzed cross-coupling reactions have profoundly transformed medicinal chemistry, and thus become one of the most frequently encountered types of reactions in synthesis planning. In this work, we for the first time introduce a chemical knowledge informed message passing neural network(MPNN) framework that directly identifies the intrinsic major products for metal-catalyzed cross-coupling reactions with regioselective ambiguity. Integrating both first principle methods and data-driven methods, our model achieves an overall accuracy of 95.24\\% on the test set of eight typical metal-catalyzed cross-coupling reaction types, including Suzuki-Miyaura, Stille, Sonogashira, Buchwald-Hartwig, Hiyama, Kumada, Negishi, and Heck reactions, outperforming other commonly used model types. To integrate electronic effects with steric effects in regioselectivity prediction, we propose a quantitative method to measure the steric hindrance effect. Our steric hindrance checker can successfully identify regioselectivity induced solely by steric hindrance. Notably under practical scenarios, our model outperforms 6 experimental organic chemists with an average working experience of over 10 years in the organic synthesis industry in terms of predicting major products in regioselective cases. We have also exemplified the practical usage of our model by fixing routes designed by open-access synthesis planning software and improving reactions by identifying low-cost starting materials. To assist general chemists in making prompt decisions about regioselectivity, we have developed a free web-based AI-empowered tool. Our code and web tool have been made available at https:\/\/github.com\/Chemlex-AI\/regioselectivity and https:\/\/ai.tools.chemlex.com\/region-choose, respectively.","date":"2024-03-27","journal":"chemRxiv","categories":"Theoretical and Computational Chemistry; Machine Learning","metrics":null,"license":"CC BY NC ND 4.0"}
{"title":"Linear Amine-Linked Oligo-BODIPYs: Convergent Access via Buchwald-Hartwig Coupling","doi":"10.26434\/chemrxiv-2024-1l0sn","published_doi":"N.A.","published_url":"N.A.","authors":"Sebastian H. Röttger; Lukas J. Patalag; Felix Hasenmaile; Lukas Milbrandt; Burkhard Butschke; Peter G. Jones; Daniel B. Werz","abstract":"A convergent route towards nitrogen-bridged BODIPY oligomers has been developed. The synthetic key step is a Buchwald-Hartwig cross-coupling reaction of an alpha-amino-BODIPY and the respective halide. Not only does the selective synthesis provide control of the oligomer size, but the facile preparative procedure also enables easy access to this type of dyes. Furthermore, functionalized examples were accessible via brominated derivatives.","date":"2024-02-28","journal":"chemRxiv","categories":"Organic Chemistry; Organic Compounds and Functional Groups","metrics":null,"license":"CC BY NC 4.0"}
{"title":"Non-Innocent Electrophiles Unlock Exogenous Base-Free Coupling Reactions","doi":"10.26434\/chemrxiv.14217314.v1","published_doi":"N.A.","published_url":"N.A.","authors":"Georgios Toupalas; Bill Morandi","abstract":"<p><b>Transition metal catalysis\nhas revolutionized our ability to precisely manipulate matter and has placed itself\nat the forefront of the combat against societal challenges through\nkey discoveries in drug design, agriculture, material\nsynthesis and environmental sciences. Numerous important\ntransition metal catalyzed reactions rely on stoichiometric quantities of an exogenous\nbase to enable catalytic turnover. Despite playing a fundamental\nrole, paradoxically, the base poses major challenges on several fronts, <\/b><b>such as restricting the accessible chemical\nspace due to functional group incompatibilities, or causing heterogeneous\nreaction mixtures that affect reproducibility, scale-up campaigns, and the\nimplementation of emerging technologies, e.g. flow chemistry or high-throughput\nexperimentation. Ultimately, this impedes innovation across\nmultiple areas. Here we introduce a unifying strategy that eliminates the need\nfor <\/b><b>an exogenous base through\nthe use of non-innocent electrophiles (NIE).  Key to its success was the encryption of the\nbase into the electrophile<\/b><b> rendering\nit non-innocent, thus preserving the synthetic utility of the original reaction\nwhile overcoming the challenges associated with the exogenous base. The use of nickel\nas an earth-abundant metal catalyst as well as the employment of ubiquitous\nphenol derivatives<\/b><b> as non-innocent\nelectrophiles are further salient features of this sustainable protocol<\/b><b>. The universal applicability <\/b><b>of this concept was demonstrated by turning multiple traditionally base-dependent\ncatalytic reactions, e.g. the Buchwald-Hartwig amination, the Mizoroki-Heck\nreaction and the Suzuki-Miyaura coupling, into exogenous base-free<\/b><b>\nhomogeneous processes. In a broader context<\/b><b>, the results presented in this work provide a <\/b><b>conceptual blueprint for the utilization of\nnon-innocent electrophiles to overcome core limitations and unlock novel\nfeatures in catalysis. <\/b><\/p>","date":"2021-03-16","journal":"chemRxiv","categories":"Homogeneous Catalysis","metrics":null,"license":"CC BY NC ND 4.0"}
{"title":"One-step Catalyst-Transfer Macrocyclization: Expanding the Chemical Space of Azaparacyclophanes","doi":"10.26434\/chemrxiv-2024-rfzjm","published_doi":"N.A.","published_url":"N.A.","authors":"Josue Ayuso-Carrillo; Federica Fina; El Czar Galleposo; Ruben Ferreira; Pradip Kumar Mondal; Benjamin D. Ward; Davide Bonifazi","abstract":"In this paper, we report on a one-step catalyst-transfer macrocyclization (CTM) reaction, based on the Pd-catalyzed Buchwald-Hartwig cross-coupling reaction, selectively affording only cyclic structures. This route offers a versatile and efficient approach to synthesize aza[1n]paracyclophanes (APCs) featuring diverse functionalities and lumens. The method operates at mild reaction temperatures (40 °C) and short reaction times (~2 h), delivering excellent isolated yields (>75% macrocycles) and up to 30% of the 6-membered cyclophane, all under non-high-dilution concentrations (35-350 mM). Structural insights into APCs reveal variations in product distribution based on different endocyclic substituents, with steric properties of exocyclic substituents having minimal influence on the macrocyclization. Aryl-type endocyclic substituents predominantly yield 6-membered macrocycles, while polycyclic aromatic units such as fluorene and carbazole favor 4-membered species. Experimental and computational studies support a proposed mechanism of ring-walking catalyst-transfer that promotes the macrocycle formation. It has been found that the macrocyclization is driven by the formation of cyclic conformers during the oligomerization step favoring an intramolecular C–N bond formation that, depending on the cycle size, hinges on either pre-organization effect or kinetic increase of the reductive elimination step or a combination of the two. The CTM process exhibits a \"living\" behavior, facilitating sequential synthesis of other macrocycles by introducing relevant monomers, thus providing a practical synthetic platform for chemical libraries. Notably, CTM operates both under diluted and concentrated regimes, offering scalability potential, unlike typical macrocyclization reactions usually operating in the 0.1–1 mM range.","date":"2024-02-19","journal":"chemRxiv","categories":"Organic Chemistry; Catalysis; Polymer Science; Organic Synthesis and Reactions; Organic Polymers; Polymerization (Polymers)","metrics":null,"license":"CC BY NC ND 4.0"}
{"title":"On the Use of Real-World Datasets for Reaction Yield Prediction","doi":"10.26434\/chemrxiv-2021-2x06r-v3","published_doi":"N.A.","published_url":"N.A.","authors":"Mandana Saebi; Bozhao Nan; John Herr; Jessica Wahlers; Zhichun  Guo; Andrzej Zurański; Thierry Kogej; Per-Ola Norrby; Abigail Doyle; Olaf Wiest; Nitesh Chawla","abstract":"The lack of publicly available, large, and unbiased datasets is a key bottleneck for the application of machine learning (ML) methods in synthetic chemistry. Data from electronic laboratory notebooks (ELNs) could provide less biased, large datasets, but no such datasets have been made publicly available. The first real-world dataset from the ELNs of a large pharmaceutical company is disclosed and its relationship to high-throughput experimentation (HTE) datasets is described.  For chemical yield predictions, a key task in chemical synthesis, an attributed graph neural network (AGNN) performs as good or better than the best previous models on two HTE datasets for the Suzuki and Buchwald-Hartwig reactions. However, training of the AGNN on the ELN dataset does not lead to a predictive model. The implications of using ELN data for training ML-based models are discussed in the context of yield predictions.","date":"2021-09-27","journal":"chemRxiv","categories":"Theoretical and Computational Chemistry; Analytical Chemistry; Computational Chemistry and Modeling; Machine Learning; Artificial Intelligence","metrics":null,"license":"CC BY NC ND 4.0"}
